{"class_name": "Sequential", "config": {"name": "sequential_37", "layers": [{"class_name": "Dense", "config": {"name": "dense_37", "trainable": true, "dtype": "float32", "units": 15, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}], "build_input_shape": [null, 1794, 51]}, "keras_version": "2.3.1", "backend": "tensorflow"}