{"class_name": "Sequential", "config": {"name": "sequential_4", "layers": [{"class_name": "TCN", "config": {"name": "tcn_4", "trainable": true, "batch_input_shape": [null, null, 51], "dtype": "float32", "nb_filters": 64, "kernel_size": 2, "nb_stacks": 1, "dilations": [1, 2], "padding": "causal", "use_skip_connections": true, "dropout_rate": 0.2, "return_sequences": true, "activation": "relu", "use_batch_norm": false, "kernel_initializer": "he_normal"}}, {"class_name": "Dense", "config": {"name": "dense_4", "trainable": true, "dtype": "float32", "units": 15, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}, "keras_version": "2.3.1", "backend": "tensorflow"}